1yib.rust-bundle
bradlc.vscode-tailwindcss
dbaeumer.vscode-eslint
dsznajder.es7-react-js-snippets
dustypomerleau.rust-syntax
eamodio.gitlens
esbenp.prettier-vscode
ethansk.restore-terminals
figma.figma-vscode-extension
github.copilot
github.copilot-chat
github.vscode-github-actions
humao.rest-client
ms-azuretools.vscode-docker
ms-dotnettools.csdevkit
ms-dotnettools.csharp
ms-dotnettools.vscode-dotnet-runtime
ms-dotnettools.vscodeintellicode-csharp
ms-mssql.data-workspace-vscode
ms-mssql.mssql
ms-mssql.sql-bindings-vscode
ms-mssql.sql-database-projects-vscode
ms-vscode-remote.remote-containers
ms-vscode.cpptools
ms-vscode.vscode-typescript-next
pkief.material-icon-theme
qwtel.sqlite-viewer
redhat.vscode-yaml
rust-lang.rust-analyzer
serayuzgur.crates
streetsidesoftware.code-spell-checker
tamasfe.even-better-toml
vintharas.learn-vim
visualstudioexptteam.intellicode-api-usage-examples
visualstudioexptteam.vscodeintellicode
vscodevim.vim
yoavbls.pretty-ts-errors
